export function getMotivation(days) {
  if (days < 1)
    return "هر روز زمان تازه‌ای برای شروع دوباره است. همین حالا اراده کن و آغاز کن.";
  if (days < 2)
    return "هر گام کوچک، زمینه‌ساز موفقیت بزرگ فرداست. روی امروزت تمرکز کن.";
  if (days < 3)
    return "پیروزی در همین ثبات‌های کوچیک شکل می‌گیره. کارت رو ادامه بده!";
  if (days < 5)
    return "پایداری عمق انتخاب‌های تو رو نشون می‌ده. به تلاشت ایمان داشته باش.";
  if (days < 7)
    return "انرژی مثبتت در حال تقویت شدنه. زمان در کنار تعهد جواب می‌ده.";
  if (days < 10)
    return "تو داری به خودت احترام می‌ذاری و مسیر رشد رو جدی گرفتی.";
  if (days < 14)
    return "تا اینجا عالی بودی! الان دیگه عادت‌های سالم داره ریشه می‌گیره.";
  if (days < 21)
    return "سه هفته مقاومت یعنی مغز و ذهن در حال بازسازی خود هستند.";
  if (days < 30)
    return "تو داری نظم و قدرت اراده‌ات رو هر روز قوی‌تر می‌کنی.";
  if (days < 45)
    return "پایداری و وفاداری به هدف، تو رو به سطح بالاتری می‌بره.";
  if (days < 60)
    return "شخصیت تو داره با این استمرار متحول می‌شه. همون‌طور ادامه بده.";
  if (days < 90)
    return "تو به مرحله‌ای رسیدی که گذشته دیگه قدرتی روی تو نداره.";
  if (days < 120)
    return "تجربه موفقیتت الهام‌بخش خودت و آدم‌های اطرافت خواهد بود.";
  if (days < 180)
    return "تو نمونه قدرت، ثبات و رشد فردی هستی. به خودت افتخار کن.";
  if (days < 365)
    return "یک سال مسیر رشد، یعنی یک عمر تجربه و پیروزی تازه.";
  return "تو ثابت کردی اراده و نظم، زندگی رو متحول می‌کنن. این مسیر تا همیشه ادامه داره و آینده‌ای روشن در انتظار توست.";
}
